#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cluster.random_password.master_password[0]: Refreshing state... [id=none]
module.cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=kJRYQg]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03f99d7f0db04e8ef]
module.cluster.data.aws_partition.current: Reading...
module.cluster.aws_security_group.this[0]: Refreshing state... [id=sg-06e364233d44c2611]
data.aws_availability_zones.available: Reading...
module.cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=amigo-oculto]
module.cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.cluster.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20220607142337041600000001]
module.cluster.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-2517837336]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b8d4ce02db04840d]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d637798586ff49bb]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-075b90fd1177ce0b9]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02f77cc9bcbc026bf]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0adcedbe2758092bd]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ff4c31866b08dfd2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-02fb1add93960d33b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-054ea7573cf33fc47]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0941f512d54f15046]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b824bc893c403af0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-072d3e61289094707]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023e56bf0ae4af6fb]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-010b351a8d5d9e6a9]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06fc2e1ab86624082]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-04acda6553410ab56]
module.db_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-08800afad0112f4f5]
module.cluster.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20220607142337041600000001-20220607142338084800000003]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-034f56718900e6450]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-06a0fb8d6392682b5]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0baab7059cbf28e7e]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08d212e532c4cac7a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0939af8a44cd091df]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b56e3205bf398a76]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023e56bf0ae4af6fb1080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-089055ae3a10b0789]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-081238b88ff2507e8]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0558824340d7d0d7c]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0941f512d54f150461080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0adcedbe2758092bd1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-02fb1add93960d33b1080289494]
module.db_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3292186123]
module.db_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2423601628]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.aws_iam_role.rds_enhanced_monitoring[0] has changed
  ~ resource "aws_iam_role" "rds_enhanced_monitoring" {
        id                    = "terraform-20220607142337041600000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole",
        ]
        name                  = "terraform-20220607142337041600000001"
        tags                  = {
            "Environment" = "amigo-oculto"
            "Terraform"   = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cluster.aws_security_group.this[0] has changed
  ~ resource "aws_security_group" "this" {
        id                     = "sg-06e364233d44c2611"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "From allowed SGs"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-08800afad0112f4f5",
                ]
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "amigo-oculto-20220607142337046600000002"
        tags                   = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + allow_major_version_upgrade     = false
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backtrack_window                = 0
      + backup_retention_period         = 7
      + cluster_identifier              = "amigo-oculto"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "amigo-oculto"
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + enabled_cloudwatch_logs_exports = [
          + "postgresql",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "13.6"
      + engine_version_actual           = (known after apply)
      + final_snapshot_identifier       = "final-amigo-oculto-90945842"
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "root"
      + port                            = 5432
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags                            = {
          + "Environment" = "amigo-oculto"
          + "Terraform"   = "true"
        }
      + tags_all                        = {
          + "Environment" = "amigo-oculto"
          + "Terraform"   = "true"
        }
      + vpc_security_group_ids          = [
          + "sg-06e364233d44c2611",
        ]

      + timeouts {}
    }

  # module.cluster.aws_rds_cluster_instance.this["2"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "amigo-oculto"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "amigo-oculto-2"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.medium"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 10
      + monitoring_role_arn                   = "arn:aws:iam::130139148959:role/terraform-20220607142337041600000001"
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Environment" = "amigo-oculto"
          + "Terraform"   = "true"
        }
      + tags_all                              = {
          + "Environment" = "amigo-oculto"
          + "Terraform"   = "true"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.cluster.aws_rds_cluster_instance.this["one"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "amigo-oculto"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "amigo-oculto-one"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.small"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 10
      + monitoring_role_arn                   = "arn:aws:iam::130139148959:role/terraform-20220607142337041600000001"
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Environment" = "amigo-oculto"
          + "Terraform"   = "true"
        }
      + tags_all                              = {
          + "Environment" = "amigo-oculto"
          + "Terraform"   = "true"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @samuelbraga, Action: `pull_request`, Working Directory: `iac`, Workflow: `.github/workflows/ci_iac_workflow.yaml`*